<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="黑夜降临那一刻，我就这那里"><title>ELK stack 之 ElasticSearch  预研 | 深度空间</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/4.1.1/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.6.2/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/2.2.3/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">ELK stack 之 ElasticSearch  预研</h1><a id="logo" href="/.">深度空间</a><p class="description">渴望展翅翱翔</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">ELK stack 之 ElasticSearch  预研</h1><div class="post-meta">Jun 12, 2016<span> | </span><span class="category"><a href="/categories/技术/">技术</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/06/12/ELK stack 之 ElasticSearch  预研/" href="/2016/06/12/ELK stack 之 ElasticSearch  预研/#comments" class="ds-thread-count"></a><div class="post-content"><p>&lt;!-- toc --&gt;</p>
<ul>
<li><a href="#elasticsearch%E7%9A%84%E9%A2%84%E7%A0%94%E7%9B%AE%E7%9A%84">ElasticSearch&#x7684;&#x9884;&#x7814;&#x76EE;&#x7684;</a></li>
<li><a href="#elasticsearch%E6%98%AF%E4%BB%80%E4%B9%88">ElasticSearch&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</a></li>
<li><a href="#elasticsearch%E8%83%BD%E5%81%9A%E4%BB%80%E4%B9%88">ElasticSearch&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</a></li>
<li><a href="#%E6%A0%B8%E5%BF%83%E6%A6%82%E5%BF%B5">&#x6838;&#x5FC3;&#x6982;&#x5FF5;</a>
<ul>
<li><a href="#%E8%BF%91%E4%B9%8E%E5%AE%9E%E6%97%B6-near-realtime">&#x8FD1;&#x4E4E;&#x5B9E;&#x65F6; (Near Realtime)</a></li>
<li><a href="#%E9%9B%86%E7%BE%A4-cluster">&#x96C6;&#x7FA4; (Cluster)</a></li>
<li><a href="#%E8%8A%82%E7%82%B9node">&#x8282;&#x70B9;(Node)</a></li>
<li><a href="#%E7%B4%A2%E5%BC%95index">&#x7D22;&#x5F15;(Index)</a></li>
<li><a href="#%E6%96%87%E6%A1%A3%E7%B1%BB%E5%9E%8Btype">&#x6587;&#x6863;&#x7C7B;&#x578B;(Type)</a></li>
<li><a href="#%E6%96%87%E6%A1%A3document">&#x6587;&#x6863;(Document)</a></li>
<li><a href="#%E5%88%86%E7%89%87%E7%B4%A2%E5%BC%95shard">&#x5206;&#x7247;&#x7D22;&#x5F15;(Shard)</a></li>
<li><a href="#%E7%B4%A2%E5%BC%95%E5%89%AF%E6%9C%ACreplica">&#x7D22;&#x5F15;&#x526F;&#x672C;(Replica)</a></li>
</ul>
</li>
<li><a href="#%E6%A0%B8%E5%BF%83%E7%89%B9%E6%80%A7">&#x6838;&#x5FC3;&#x7279;&#x6027;</a></li>
</ul>
<p>&lt;!-- tocstop --&gt;</p>
<hr>
<h3 id="elasticsearch&#x7684;&#x9884;&#x7814;&#x76EE;&#x7684;">ElasticSearch&#x7684;&#x9884;&#x7814;&#x76EE;&#x7684;</h3>
<p>&#x4F5C;&#x4E3A;ELKstack&#x6280;&#x672F;&#x6808;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#xFF0C;ElasticSearch&#x662F;&#x4F5C;&#x4E3A;&#x5B58;&#x50A8;&#x4EE5;&#x53CA;&#x68C0;&#x7D22;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5373;&#x65E5;&#x5FD7;&#x89E3;&#x6790;&#x540E;&#x7EDF;&#x4E00;&#x90FD;&#x662F;&#x653E;&#x5728;ElasticSearch&#x4E0A;&#x9762;&#xFF0C;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x4ED3;&#x50A8;&#x91CD;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x4E5F;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x4E0B;&#x5176;&#x771F;&#x662F;&#x9762;&#x76EE;(&#x5373;<strong>&#x662F;&#x4EC0;&#x4E48;</strong>)&#x4EE5;&#x53CA;&#x5176;<strong>&#x80FD;&#x505A;&#x4EC0;&#x4E48;</strong>&#xFF0C;&#x8981;&#x7406;&#x89E3;ElasticSearch&#x7684;<strong>&#x6838;&#x5FC3;&#x6982;&#x5FF5;</strong>,&#x5E76;&#x638C;&#x63E1;&#x76F8;&#x5173;&#x64CD;&#x4F5C;(&#x68C0;&#x7D22;)&#x3002;</p>
<h3 id="elasticsearch&#x662F;&#x4EC0;&#x4E48;">ElasticSearch&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h3>
<p>Elasticsearch&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x5F00;&#x6E90;&#x5168;&#x6587;&#x641C;&#x7D22;&#x548C;&#x5206;&#x6790;&#x5F15;&#x64CE;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x5B58;&#x50A8;&#xFF0C;&#x641C;&#x7D22;&#xFF0C;&#x5E76;&#x4EE5;&#x8FD1;&#x4E4E;&#x5B9E;&#x65F6;&#x7684;&#x901F;&#x5EA6;&#x5206;&#x6790;&#x5927;&#x5BB9;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x7528;&#x4F5C;&#x5E95;&#x5C42;&#x5F15;&#x64CE;/&#x6280;&#x672F;&#xFF0C;&#x53BB;&#x652F;&#x6491;&#x5177;&#x6709;&#x590D;&#x6742;&#x7684;&#x641C;&#x7D22;&#x529F;&#x80FD;&#x548C;&#x9700;&#x6C42;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>Elasticsearch&#x6240;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x6280;&#x672F;&#x90FD;&#x4E0D;&#x662F;&#x521B;&#x65B0;&#x6216;&#x8005;&#x9769;&#x547D;&#x6027;&#x7684;&#xFF0C;&#x5168;&#x6587;&#x641C;&#x7D22;&#xFF0C;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x8FD9;&#x4E9B;&#x65E9;&#x5C31;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x3002;&#x5B83;&#x7684;&#x9769;&#x547D;&#x6027;&#x5728;&#x4E8E;&#x5C06;&#x8FD9;&#x4E9B;&#x72EC;&#x7ACB;&#x4E14;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#x6574;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x4E00;&#x4F53;
&#x5316;&#x7684;&#x3001;&#x5B9E;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5B83;&#x5BF9;&#x65B0;&#x7528;&#x6237;&#x7684;&#x95E8;&#x69DB;&#x5F88;&#x4F4E;&#xFF0C;&#x5F53;&#x7136;&#x5B83;&#x4E5F;&#x4F1A;&#x8DDF;&#x4E0A;&#x4F60;&#x6280;&#x80FD;&#x548C;&#x9700;&#x6C42;&#x589E;&#x957F;&#x7684;&#x6B65;&#x4F10;&#x3002;</p>
<h3 id="elasticsearch&#x80FD;&#x505A;&#x4EC0;&#x4E48;">ElasticSearch&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</h3>
<p>Elasticsearch&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Apache Lucene(TM)&#x7684;&#x5F00;&#x6E90;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;</p>
<blockquote>
<p>Elasticsearch&#x4F7F;&#x7528;Java&#x5F00;&#x53D1;&#x5E76;&#x4F7F;&#x7528;Lucene&#x4F5C;&#x4E3A;&#x5176;&#x6838;&#x5FC3;&#x6765;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x7D22;&#x5F15;&#x548C;&#x641C;&#x7D22;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684; RESTful API &#x6765;&#x9690;&#x85CF;Lucene&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x5168;&#x6587;&#x641C;&#x7D22;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x3002;</p>
</blockquote>
<p>&#x4E0D;&#x8FC7;&#xFF0C;Elasticsearch&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;Lucene&#x548C;&#x5168;&#x6587;&#x641C;&#x7D22;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x80FD;&#x8FD9;&#x6837;&#x53BB;&#x63CF;&#x8FF0;&#x5B83;&#xFF1A;</p>
<blockquote>
<ul>
<li>&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x5B9E;&#x65F6;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x90FD;&#x88AB;&#x7D22;&#x5F15;&#x5E76;&#x53EF;&#x88AB;&#x641C;&#x7D22;</li>
<li>&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x5B9E;&#x65F6;&#x5206;&#x6790;&#x641C;&#x7D22;&#x5F15;&#x64CE;</li>
<li>&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x4E0A;&#x767E;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5904;&#x7406;PB&#x7EA7;&#x7ED3;&#x6784;&#x5316;&#x6216;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;</li>
</ul>
</blockquote>
<p>&#x800C;&#x4E14;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x88AB;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x91CC;&#x9762;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684; RESTful API &#x3001;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x751A;&#x81F3;&#x547D;&#x4EE4;&#x884C;&#x4E0E;&#x4E4B;&#x4EA4;&#x4E92;&#x3002;</p>
<h3 id="&#x6838;&#x5FC3;&#x6982;&#x5FF5;">&#x6838;&#x5FC3;&#x6982;&#x5FF5;</h3>
<h4 id="&#x8FD1;&#x4E4E;&#x5B9E;&#x65F6;-near-realtime">&#x8FD1;&#x4E4E;&#x5B9E;&#x65F6; (Near Realtime)</h4>
<p>Elasticsearch&#x662F;&#x4E00;&#x4E2A;&#x8FD1;&#x4E4E;&#x5B9E;&#x65F6;&#x7684;&#x641C;&#x7D22;&#x5E73;&#x53F0;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6709;&#x8F7B;&#x5FAE;&#x7684;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#xFF08;&#x901A;&#x5E38;&#x4E3A;&#x4E00;&#x79D2;&#xFF09;&#x4ECE;&#x4F60;&#x5F00;&#x59CB;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x76F4;&#x5230;&#x5B83;&#x53D8;&#x6210;&#x662F;&#x53EF;&#x641C;&#x7D22;&#x7684;&#x3002;</p>
<h4 id="&#x96C6;&#x7FA4;-cluster">&#x96C6;&#x7FA4; (Cluster)</h4>
<p>&#x96C6;&#x7FA4;&#x662F;&#x591A;&#x4E2A;ElasticSearch<strong>&#x8282;&#x70B9;&#x7684;&#x96C6;&#x5408;</strong>&#x3002;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x9F50;&#x5FC3;&#x534F;&#x529B;&#x5E94;&#x5BF9;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x7684;&#x641C;&#x7D22;&#x9700;&#x6C42;&#x548C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x9700;&#x6C42;&#x3002;&#x96C6;&#x7FA4;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5E94;&#x5BF9;&#x7531;&#x4E8E;&#x90E8;&#x5206;&#x673A;&#x5668;(&#x8282;&#x70B9;)&#x8FD0;&#x884C;&#x4E2D;&#x65AD;&#x6216;&#x8005;&#x5347;&#x7EA7;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x5229;&#x5668;&#x3002;ElasticSearch&#x63D0;&#x4F9B;&#x7684;&#x96C6;&#x7FA4;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x51E0;&#x4E4E;&#x662F;&#x65E0;&#x7F1D;&#x8FDE;&#x63A5;(&#x6240;&#x8C13;&#x65E0;&#x7F1D;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x96C6;&#x7FA4;&#x5BF9;&#x5916;&#x800C;&#x8A00;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6216;&#x8005;&#x53BB;&#x6389;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5BF9;&#x7528;&#x6237;&#x800C;&#x8A00;&#x662F;&#x900F;&#x660E;&#x7684;)&#x3002;&#x5728;ElasticSearch&#x4E2D;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x4E0E;&#x540C;&#x7C7B;&#x4EA7;&#x54C1;&#x4E2D;&#x7ADE;&#x4E89;&#x6240;&#x4F53;&#x73B0;&#x51FA;&#x7684;&#x6700;&#x5927;&#x4F18;&#x52BF;&#x3002;</p>
<h4 id="&#x8282;&#x70B9;node">&#x8282;&#x70B9;(Node)</h4>
<p>&#x5355;&#x72EC;&#x4E00;&#x4E2A;ElasticSearch&#x670D;&#x52A1;&#x5668;<strong>&#x5B9E;&#x4F8B;</strong>&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6765;&#x8BF4;&#xFF0C;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x5355;&#x8282;&#x70B9;&#x7684;ElasticSearch&#x670D;&#x52A1;&#x5668;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x8003;&#x8651;&#x5230;&#x5BB9;&#x9519;&#x6027;&#x548C;&#x6570;&#x636E;&#x8FC7;&#x8F7D;&#xFF0C;&#x914D;&#x7F6E;&#x591A;&#x8282;&#x70B9;&#x7684;ElasticSearch&#x96C6;&#x7FA4;&#x662F;&#x660E;&#x667A;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h4 id="&#x7D22;&#x5F15;index">&#x7D22;&#x5F15;(Index)</h4>
<p>ElasticSearch&#x628A;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x7D22;&#x5F15;(indices)&#x4E2D;&#x3002;&#x5982;&#x679C;&#x7528;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x578B;&#x5BF9;&#x6BD4;&#xFF0C;&#x7D22;&#x5F15;(index)&#x7684;&#x5730;&#x4F4D;&#x4E0E;<strong>&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;(database)&#x76F8;&#x5F53;</strong>&#x3002;&#x7D22;&#x5F15;&#x5B58;&#x653E;&#x548C;&#x8BFB;&#x53D6;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#x662F;&#x6587;&#x6863;(Document)&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E00;&#x518D;&#x5F3A;&#x8C03;&#xFF0C;ElasticSearch&#x5185;&#x90E8;&#x7528;Apache Lucene&#x5B9E;&#x73B0;&#x7D22;&#x5F15;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x5199;&#x3002;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x6E05;&#x695A;&#x7684;&#x662F;&#xFF1A;&#x5728;ElasticSearch&#x4E2D;&#x88AB;&#x89C6;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;(index)&#xFF0C;&#x5728;Lucene&#x4E2D;&#x53EF;&#x80FD;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;ElasticSearch&#x4F1A;&#x7528;&#x5230;&#x5206;&#x7247;(shards)&#x548C;&#x5907;&#x4EFD;(replicas)&#x673A;&#x5236;&#x5C06;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;(index)&#x5B58;&#x50A8;&#x591A;&#x4EFD;&#x3002;</p>
<h4 id="&#x6587;&#x6863;&#x7C7B;&#x578B;type">&#x6587;&#x6863;&#x7C7B;&#x578B;(Type)</h4>
<p>&#x6BCF;&#x4E2A;&#x6587;&#x6863;&#x5728;ElasticSearch&#x4E2D;&#x90FD;&#x5FC5;&#x987B;&#x8BBE;&#x5B9A;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x6587;&#x6863;&#x7C7B;&#x578B;&#x4F7F;&#x5F97;&#x540C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#x5728;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x4E0D;&#x540C;&#x6587;&#x6863;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4F9D;&#x636E;&#x6587;&#x6863;&#x7C7B;&#x578B;&#x5C31;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x53C2;&#x6570;&#x6620;&#x5C04;(Mapping)&#x4FE1;&#x606F;&#xFF0C;&#x65B9;&#x4FBF;&#x6587;&#x6863;&#x7684;&#x5B58;&#x53D6;&#x3002;</p>
<h4 id="&#x6587;&#x6863;document">&#x6587;&#x6863;(Document)</h4>
<p>&#x5728;ElasticSearch&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x6587;&#x6863;(Document)&#x662F;&#x4E3B;&#x8981;&#x7684;<strong>&#x5B58;&#x5728;&#x5B9E;&#x4F53;</strong>(&#x5728;Lucene&#x4E2D;&#x4E5F;&#x662F;&#x5982;&#x6B64;)&#x3002;&#x6240;&#x6709;&#x7684;ElasticSearch&#x5E94;&#x7528;&#x9700;&#x6C42;&#x5230;&#x6700;&#x540E;&#x90FD;&#x53EF;&#x4EE5;&#x7EDF;&#x4E00;&#x5EFA;&#x6A21;&#x6210;&#x4E00;&#x4E2A;&#x68C0;&#x7D22;&#x6A21;&#x578B;&#xFF1A;&#x68C0;&#x7D22;&#x76F8;&#x5173;&#x6587;&#x6863;&#x3002;&#x6587;&#x6863;(Document)&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x57DF;(Field)&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x57DF;(Field)&#x7531;&#x4E00;&#x4E2A;&#x57DF;&#x540D;(&#x6B64;&#x57DF;&#x540D;&#x975E;&#x5F7C;&#x57DF;&#x540D;)&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x503C;&#x7EC4;&#x6210;(&#x6709;&#x591A;&#x4E2A;&#x503C;&#x7684;&#x503C;&#x79F0;&#x4E3A;&#x591A;&#x503C;&#x57DF;(multi-valued))&#x3002;&#x5728;ElasticSeach&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6587;&#x6863;(Document)&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x57DF;(Field)&#x96C6;&#x5408;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6587;&#x6863;(Document)&#x662F;&#x6CA1;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x7EDF;&#x4E00;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x6587;&#x6863;(Document)&#x4E4B;&#x95F4;&#x4FDD;&#x6301;&#x7ED3;&#x6784;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5373;&#x53EF;(Lucene&#x4E2D;&#x7684;&#x6587;&#x6863;(Document)&#x4E5F;&#x79C9;&#x6301;&#x7740;&#x76F8;&#x540C;&#x7684;&#x89C4;&#x5B9A;)&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;ElasticSearch&#x4E2D;&#x7684;&#x6587;&#x6863;(Document)&#x5C31;&#x662F;Lucene&#x4E2D;&#x7684;&#x6587;&#x6863;(Document)&#x3002;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6587;&#x6863;(Document)&#x5C31;&#x662F;&#x4E00;&#x4E2A;JSON&#x5BF9;&#x8C61;(&#x5173;&#x4E8E;JSON&#x683C;&#x5F0F;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;,&#x8BF7;&#x53C2;&#x770B;hhtp://en.wikipedia.org/wiki/JSON)&#x3002;</p>
<h4 id="&#x5206;&#x7247;&#x7D22;&#x5F15;shard">&#x5206;&#x7247;&#x7D22;&#x5F15;(Shard)</h4>
<p>&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;&#x96C6;&#x7FA4;&#x80FD;&#x591F;&#x5B58;&#x50A8;&#x8D85;&#x51FA;&#x5355;&#x673A;&#x5BB9;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#xFF0C;ElasticSearch&#x628A;&#x6570;&#x636E;&#x5206;&#x53D1;&#x5230;&#x591A;&#x4E2A;&#x5B58;&#x50A8;Lucene&#x7D22;&#x5F15;&#x7684;&#x7269;&#x7406;&#x673A;&#x4E0A;&#x3002;&#x8FD9;&#x4E9B;Lucene&#x7D22;&#x5F15;&#x79F0;&#x4E3A;&#x5206;&#x7247;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x7D22;&#x5F15;&#x5206;&#x7247;(Sharding)&#x3002;&#x5728;ElasticSearch&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x7D22;&#x5F15;&#x5206;&#x7247;(Sharding)&#x662F;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6240;&#x6709;&#x5206;&#x7247;&#x7D22;&#x5F15;(Shard)&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x7684;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x7D22;&#x5F15;&#x5206;&#x7247;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x9700;&#x8981;&#x4E8B;&#x5148;&#x8C03;&#x6574;&#x597D;&#x53C2;&#x6570;&#x3002;&#x56E0;&#x4E3A;&#x96C6;&#x7FA4;&#x4E2D;&#x5206;&#x7247;&#x7684;&#x6570;&#x91CF;&#x9700;&#x8981;&#x5728;&#x7D22;&#x5F15;&#x521B;&#x5EFA;&#x524D;&#x914D;&#x7F6E;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x670D;&#x52A1;&#x5668;&#x542F;&#x52A8;&#x540E;&#x662F;&#x65E0;&#x6CD5;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x76EE;&#x524D;&#x65E0;&#x6CD5;&#x4FEE;&#x6539;&#x3002;</p>
<h4 id="&#x7D22;&#x5F15;&#x526F;&#x672C;replica">&#x7D22;&#x5F15;&#x526F;&#x672C;(Replica)</h4>
<p>&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#x5206;&#x7247;&#x673A;&#x5236;(Sharding)&#x53EF;&#x4EE5;&#x5411;ElasticSearch&#x96C6;&#x7FA4;&#x4E2D;&#x5BFC;&#x5165;&#x8D85;&#x8FC7;&#x5355;&#x673A;&#x5BB9;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x64CD;&#x4F5C;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5373;&#x53EF;&#x5B9E;&#x73B0;&#x5BF9;&#x96C6;&#x7FA4;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x5F53;&#x96C6;&#x7FA4;&#x8D1F;&#x8F7D;&#x589E;&#x957F;&#xFF0C;&#x7528;&#x6237;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x963B;&#x585E;&#x5728;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#x526F;&#x672C;(Replica)&#x673A;&#x5236;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7D22;&#x5F15;&#x526F;&#x672C;(Replica)&#x673A;&#x5236;&#x7684;&#x7684;&#x601D;&#x8DEF;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x4E3A;&#x7D22;&#x5F15;&#x5206;&#x7247;&#x521B;&#x5EFA;&#x4E00;&#x4EFD;&#x65B0;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x50CF;&#x539F;&#x6765;&#x7684;&#x4E3B;&#x5206;&#x7247;&#x4E00;&#x6837;&#x5904;&#x7406;&#x7528;&#x6237;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x987A;&#x4FBF;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x636E;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5373;&#x5982;&#x679C;&#x4E3B;&#x5206;&#x7247;&#x6570;&#x636E;&#x4E22;&#x5931;&#xFF0C;ElasticSearch&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#x526F;&#x672C;&#x4F7F;&#x5F97;&#x6570;&#x636E;&#x4E0D;&#x4E22;&#x5931;&#x3002;&#x7D22;&#x5F15;&#x526F;&#x672C;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x6DFB;&#x52A0;&#x6216;&#x8005;&#x5220;&#x9664;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x5176;&#x6570;&#x91CF;&#x3002;</p>
<h3 id="&#x6838;&#x5FC3;&#x7279;&#x6027;">&#x6838;&#x5FC3;&#x7279;&#x6027;</h3>
<p>&#x4ECE;&#x67B6;&#x6784;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3B;&#x8981;&#x7279;&#x6027;&#x662F;&#xFF1A;</p>
<blockquote>
<ul>
<li>&#x5F00;&#x7BB1;&#x5373;&#x7528;&#x3002;&#x5B89;&#x88C5;&#x597D;ElasticSearch&#x540E;&#xFF0C;&#x6240;&#x6709;&#x53C2;&#x6570;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x90FD;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x4E86;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x8C03;&#x6574;&#x3002;&#x5305;&#x62EC;&#x5185;&#x7F6E;&#x7684;&#x53D1;&#x73B0;&#x673A;&#x5236;(&#x6BD4;&#x5982;Field&#x7C7B;&#x578B;&#x7684;&#x81EA;&#x52A8;&#x5339;&#x914D;)&#x548C;&#x81EA;&#x52A8;&#x5316;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#x3002;</li>
<li>&#x5929;&#x751F;&#x96C6;&#x7FA4;&#x3002;ElasticSearch&#x9ED8;&#x8BA4;&#x5DE5;&#x4F5C;&#x5728;&#x96C6;&#x7FA4;&#x6A21;&#x5F0F;&#x4E0B;&#x3002;&#x8282;&#x70B9;&#x90FD;&#x5C06;&#x89C6;&#x4E3A;&#x96C6;&#x7FA4;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x542F;&#x52A8;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x81EA;&#x52A8;&#x8FDE;&#x63A5;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x3002;</li>
<li>&#x81EA;&#x52A8;&#x5BB9;&#x9519;&#x3002;ElasticSearch&#x901A;&#x8FC7;P2P&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x6D88;&#x9664;&#x4E86;&#x5355;&#x70B9;&#x6545;&#x969C;&#x3002;&#x8282;&#x70B9;&#x81EA;&#x52A8;&#x8FDE;&#x63A5;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x673A;&#x5668;&#xFF0C;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x53CA;&#x4EE5;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x76D1;&#x63A7;&#x3002;&#x7D22;&#x5F15;&#x5206;&#x7247;</li>
<li>&#x6269;&#x5C55;&#x6027;&#x5F3A;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5904;&#x7406;&#x80FD;&#x529B;&#x548C;&#x6570;&#x636E;&#x5BB9;&#x91CF;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x6269;&#x5C55;&#xFF0C;&#x5373;&#x589E;&#x6DFB;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x3002;</li>
<li>&#x8FD1;&#x5B9E;&#x65F6;&#x641C;&#x7D22;&#x548C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3002;&#x7531;&#x4E8E;ElasticSearch&#x5929;&#x751F;&#x652F;&#x6301;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x5EF6;&#x8FDF;&#x548C;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x4E0A;&#x6570;&#x636E;&#x7684;&#x77ED;&#x6682;&#x6027;&#x4E0D;&#x4E00;&#x81F4;&#x65E0;&#x53EF;&#x907F;&#x514D;&#x3002;ElasticSearch&#x901A;&#x8FC7;&#x7248;&#x672C;&#x63A7;&#x5236;(versioning)&#x7684;&#x673A;&#x5236;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x95EE;&#x9898;&#x7684;&#x51FA;&#x73B0;&#x3002;</li>
</ul>
</blockquote>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="http://crazywen.github.io/2016/06/12/ELK stack 之 ElasticSearch  预研/" data-id="cipcaoncq0000p0pr870cevsp" class="article-share-link">分享到</a><div class="tags"><a href="/tags/ELK/">ELK</a><a href="/tags/log/">log</a><a href="/tags/elasticsearch/">elasticsearch</a></div><div class="post-nav"><a href="/2016/06/07/ELK stack 之 Logstash 预研/" class="next">ELK stack 之 Logstash  预研</a></div><div data-thread-key="2016/06/12/ELK stack 之 ElasticSearch  预研/" data-title="ELK stack 之 ElasticSearch  预研" data-url="http://crazywen.github.io/2016/06/12/ELK stack 之 ElasticSearch  预研/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/06/12/ELK stack 之 ElasticSearch  预研/" data-title="ELK stack 之 ElasticSearch  预研" data-url="http://crazywen.github.io/2016/06/12/ELK stack 之 ElasticSearch  预研/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search"/><input type="hidden" name="si" value="http://crazywen.github.io"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/技术/">技术</a><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/技术/工作/">工作</a></li></ul></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/职责/" style="font-size: 15px;">职责</a> <a href="/tags/ELK/" style="font-size: 15px;">ELK</a> <a href="/tags/elasticsearch/" style="font-size: 15px;">elasticsearch</a> <a href="/tags/Shell/" style="font-size: 15px;">Shell</a> <a href="/tags/Linux/" style="font-size: 15px;">Linux</a> <a href="/tags/软件设计/" style="font-size: 15px;">软件设计</a> <a href="/tags/设计模式/" style="font-size: 15px;">设计模式</a> <a href="/tags/log/" style="font-size: 15px;">log</a> <a href="/tags/面向对象/" style="font-size: 15px;">面向对象</a> <a href="/tags/并行/" style="font-size: 15px;">并行</a> <a href="/tags/并发/" style="font-size: 15px;">并发</a> <a href="/tags/进程/" style="font-size: 15px;">进程</a> <a href="/tags/线程/" style="font-size: 15px;">线程</a> <a href="/tags/http2-0/" style="font-size: 15px;">http2.0</a> <a href="/tags/Multiplexing/" style="font-size: 15px;">Multiplexing</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/06/12/ELK stack 之 ElasticSearch  预研/">ELK stack 之 ElasticSearch  预研</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/07/ELK stack 之 Logstash 预研/">ELK stack 之 Logstash  预研</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/31/Shell 脚本编程 —— 秘笈2/">Shell 脚本编程 —— 秘笈2</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/30/Shell 脚本编程 —— 秘笈1/">Shell 脚本编程 —— 秘笈1</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/19/卓越软件设计匠艺 —— 培训总结/">卓越软件设计匠艺 —— 培训总结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/19/进程和线程/">进程和线程</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/19/http2.0/">HTTP2.0 的改进</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/18/并行与并发/">并行和并发的区别</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="https://github.com/crazywen/" title="github-me" target="_blank">github-me</a><ul></ul><a href="https://qdan.me/" title="轻单" target="_blank">轻单</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">深度空间.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'crazywen'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>