<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="黑夜降临那一刻，我就这那里"><title>卓越软件设计匠艺 —— 培训总结 | 深度空间</title><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/4.1.1/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.6.2/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/2.2.3/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">卓越软件设计匠艺 —— 培训总结</h1><a id="logo" href="/.">深度空间</a><p class="description">渴望展翅翱翔</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">卓越软件设计匠艺 —— 培训总结</h1><div class="post-meta">May 19, 2016<span> | </span><span class="category"><a href="/categories/技术/">技术</a><a href="/categories/技术/工作/">工作</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/05/19/卓越软件设计匠艺 —— 培训总结/" href="/2016/05/19/卓越软件设计匠艺 —— 培训总结/#comments" class="ds-thread-count"></a><div class="post-content"><p>&lt;!-- toc --&gt;</p>
<ul>
<li><a href="#%E7%AC%AC%E4%B8%80%E5%8D%95%E5%85%83%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E8%AE%BE%E8%AE%A1%E4%B9%8B%E8%81%8C%E8%B4%A3">&#x7B2C;&#x4E00;&#x5355;&#x5143;&#xFF1A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x804C;&#x8D23;</a>
<ul>
<li><a href="#1-%E8%81%8C%E8%B4%A3%E7%9A%84%E5%B1%82%E6%AC%A1">1. &#x804C;&#x8D23;&#x7684;&#x5C42;&#x6B21;</a></li>
<li><a href="#2-%E8%81%8C%E8%B4%A3%E7%9A%84%E5%88%86%E7%B1%BB">2. &#x804C;&#x8D23;&#x7684;&#x5206;&#x7C7B;</a></li>
<li><a href="#3-%E5%AF%B9%E8%B1%A1%E7%9A%84%E8%A7%92%E8%89%B2">3. &#x5BF9;&#x8C61;&#x7684;&#x89D2;&#x8272;</a></li>
<li><a href="#4-%E8%81%8C%E8%B4%A3%E4%B8%8E%E5%B0%81%E8%A3%85%E7%9A%84%E5%85%B3%E7%B3%BB">4. &#x804C;&#x8D23;&#x4E0E;&#x5C01;&#x88C5;&#x7684;&#x5173;&#x7CFB;</a></li>
<li><a href="#5-%E6%A8%A1%E5%9D%97%E7%BA%A7%E7%9A%84%E8%81%8C%E8%B4%A3%E5%88%86%E9%85%8D">5. &#x6A21;&#x5757;&#x7EA7;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;</a></li>
<li><a href="#6-%E5%8E%9F%E5%88%99%E4%B8%8E%E6%A8%A1%E5%BC%8F">6. &#x539F;&#x5219;&#x4E0E;&#x6A21;&#x5F0F;</a></li>
</ul>
</li>
<li><a href="#%E7%AC%AC%E4%BA%8C%E5%8D%95%E5%85%83-%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E8%AE%BE%E8%AE%A1%E4%B9%8B%E6%8A%BD%E8%B1%A1">&#x7B2C;&#x4E8C;&#x5355;&#x5143; &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x62BD;&#x8C61;</a>
<ul>
<li><a href="#1-%E6%8A%BD%E8%B1%A1%E7%9A%84%E6%84%8F%E4%B9%89">1. &#x62BD;&#x8C61;&#x7684;&#x610F;&#x4E49;</a></li>
<li><a href="#2-%E8%AF%86%E5%88%AB%E5%8F%98%E5%8C%96">2. &#x8BC6;&#x522B;&#x53D8;&#x5316;</a></li>
<li><a href="#3-%E4%BE%9D%E8%B5%96%E8%A7%A3%E8%80%A6">3. &#x4F9D;&#x8D56;&#x89E3;&#x8026;</a></li>
<li><a href="#4-%E6%89%A9%E5%B1%95%E5%BC%8F%E8%AE%BE%E8%AE%A1">4. &#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;</a></li>
</ul>
</li>
</ul>
<p>&lt;!-- tocstop --&gt;</p>
<hr>
<h3 id="&#x7B2C;&#x4E00;&#x5355;&#x5143;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x804C;&#x8D23;">&#x7B2C;&#x4E00;&#x5355;&#x5143;&#xFF1A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x804C;&#x8D23;</h3>
<blockquote>
<ul>
<li>&#x89D2;&#x8272;&#x3001;&#x804C;&#x8D23;&#x4E0E;&#x534F;&#x4F5C;</li>
<li>&#x804C;&#x8D23;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;</li>
</ul>
</blockquote>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x6838;&#x5FC3;&#x9A71;&#x52A8;&#x529B;&#x662F;<strong>&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;</strong>&#xFF0C;&#x5408;&#x7406;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;&#x662F;&#x5353;&#x8D8A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x524D;&#x63D0;&#x3002;&#x53EA;&#x6709;&#x5408;&#x7406;&#x5730;&#x5206;&#x8FA8;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x624D;&#x80FD;&#x591F;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x7B26;&#x5408;&#x7CFB;&#x7EDF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#x534F;&#x4F5C;&#x5173;&#x7CFB;&#x3002;</p>
<h4 id="1-&#x804C;&#x8D23;&#x7684;&#x5C42;&#x6B21;">1. &#x804C;&#x8D23;&#x7684;&#x5C42;&#x6B21;</h4>
<p>&#x901A;&#x8FC7;&#x804C;&#x8D23;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x5BF9;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x8BC6;&#x522B;&#x51FA;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x3001;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x4E0E;&#x4E1A;&#x52A1;&#x5B9E;&#x73B0;&#x3002;&#x804C;&#x8D23;&#x5C42;&#x6B21;&#x7684;&#x5206;&#x89E3;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x8005;&#x8FA8;&#x522B;&#x804C;&#x8D23;&#x3002;</p>
<blockquote>
<ol>
<li>&#x804C;&#x8D23;&#x5C42;&#x6B21;&#x7684;&#x8BC6;&#x522B;</li>
<li>&#x804C;&#x8D23;&#x5C42;&#x6B21;&#x4E0E;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5C42;&#x6B21;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;</li>
<li>&#x804C;&#x8D23;&#x4E0E;&#x6982;&#x5FF5;&#x3001;&#x89C4;&#x7EA6;&#x4E0E;&#x5B9E;&#x73B0;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x5206;&#x6790;&#x90AE;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x4EE3;&#x7801;&#x66B4;&#x9732;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x3001;&#x4EE3;&#x7801;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7B49;&#x8BF8;&#x591A;&#x65B9;&#x9762;&#x7740;&#x624B;&#xFF0C;&#x5256;&#x6790;&#x4EE3;&#x7801;&#x574F;&#x5473;&#x9053;&#x3002;&#x901A;&#x8FC7;&#x5206;&#x8FA8;&#x804C;&#x8D23;&#x5C42;&#x6B21;&#xFF0C;&#x6765;&#x6539;&#x5584;&#x8BBE;&#x8BA1;&#x3002;&#x5E76;&#x63D0;&#x51FA;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x5165;&#x5BF9;Observer&#x6A21;&#x5F0F;&#x3001;Strategy&#x6A21;&#x5F0F;&#x3001;Simple Factory&#x6A21;&#x5F0F;&#x3001;Mediator&#x6A21;&#x5F0F;&#x4E0E;Chain Of Responsibility&#x6A21;&#x5F0F;&#x7684;&#x5BF9;&#x6BD4;&#x4E0E;&#x5206;&#x6790;&#xFF1B;</li>
<li>&#x5B9E;&#x6218;&#x6F14;&#x7EC3;&#xFF1A;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x8C03;&#x5EA6;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x6839;&#x636E;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x89E6;&#x53D1;&#x4F5C;&#x4E1A;&#xFF0C;&#x6267;&#x884C;&#x81EA;&#x5B9A;&#x4E49;&#x4EFB;&#x52A1;&#x3002;</li>
</ol>
</blockquote>
<h4 id="2-&#x804C;&#x8D23;&#x7684;&#x5206;&#x7C7B;">2. &#x804C;&#x8D23;&#x7684;&#x5206;&#x7C7B;</h4>
<p>&#x804C;&#x8D23;&#x5E76;&#x4E0D;&#x7B49;&#x4E8E;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x4E0D;&#x7B49;&#x540C;&#x4E8E;&#x884C;&#x4E3A;&#x6216;&#x65B9;&#x6CD5;&#x3002;&#x5206;&#x6790;&#x804C;&#x8D23;&#xFF0C;&#x5E94;&#x4ECE;&#x5BF9;&#x8C61;&#x7684;&#x8BA4;&#x77E5;&#x4E0E;&#x884C;&#x4E3A;&#x5165;&#x624B;&#x3002;</p>
<h4 id="3-&#x5BF9;&#x8C61;&#x7684;&#x89D2;&#x8272;">3. &#x5BF9;&#x8C61;&#x7684;&#x89D2;&#x8272;</h4>
<p>&#x89D2;&#x8272;&#x3001;&#x804C;&#x8D23;&#x4E0E;&#x534F;&#x4F5C;&#x662F;&#x4E09;&#x4F4D;&#x4E00;&#x4F53;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x89D2;&#x8272;&#x662F;&#x53D1;&#x8D77;&#x804C;&#x8D23;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x804C;&#x8D23;&#x5219;&#x5E94;&#x8BE5;&#x662F;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x3002;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C65;&#x884C;&#x7684;&#x804C;&#x8D23;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;</p>
<blockquote>
<ol>
<li>&#x4FE1;&#x606F;&#x6301;&#x6709;&#x8005;&#xFF1A;&#x4FE1;&#x606F;&#x7684;&#x683C;&#x5F0F;&#xFF1B;&#x662F;&#x5426;&#x9700;&#x8981;&#x6301;&#x4E45;&#x5316;&#xFF1B;&#x4FE1;&#x606F;&#x6E90;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x662F;&#x5426;&#x9700;&#x8981;&#x66F4;&#x65B0;&#xFF1B;&#x5904;&#x7406;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF1B;</li>
<li>&#x6784;&#x9020;&#x8005;&#xFF1A;&#x6784;&#x9020;&#x8005;&#x4E0E;&#x6784;&#x9020;&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x7CFB;&#xFF1B;&#x6784;&#x9020;&#x7684;&#x65B9;&#x5F0F;&#xFF1B;&#x805A;&#x5408;&#x4E0E;&#x5408;&#x6210;&#xFF1B;</li>
<li>&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8005;&#xFF1A;&#x4E3B;&#x52A8;&#x544A;&#x77E5;&#xFF0C;&#x88AB;&#x52A8;&#x544A;&#x77E5;&#xFF1B;&#x72EC;&#x7ACB;&#x7684;&#x884C;&#x4E3A;&#xFF1B;&#x63D0;&#x4F9B;&#x6709;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x7684;&#x884C;&#x4E3A;&#xFF1B;</li>
<li>&#x534F;&#x8C03;&#x8005;&#xFF1A;&#x5982;&#x4F55;&#x59D4;&#x6D3E;&#x548C;&#x8F6C;&#x53D1;&#x8BF7;&#x6C42;&#xFF1B;&#x5982;&#x4F55;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#xFF1B;&#x5982;&#x4F55;&#x901A;&#x77E5;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;&#xFF1B;</li>
<li>&#x63A7;&#x5236;&#x8005;&#xFF1A;&#x63A7;&#x5236;&#x8005;&#x4E0E;&#x88AB;&#x63A7;&#x5236;&#x8005;&#x7684;&#x5173;&#x7CFB;&#xFF1B;&#x63A7;&#x5236;&#x7684;&#x51B3;&#x7B56;&#x4E0E;&#x903B;&#x8F91;&#xFF1B;&#x9A71;&#x52A8;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#xFF1B;&#x6536;&#x96C6;&#x4E0E;&#x51B3;&#x7B56;&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#xFF1A;&#x5904;&#x7406;HTTP&#x8BF7;&#x6C42;&#x4E0E;&#x5E94;&#x7B54;&#xFF0C;&#x4F53;&#x73B0;&#x4FE1;&#x606F;&#x6301;&#x6709;&#x8005;&#x89D2;&#x8272;&#xFF1B;JMS&#x5BF9;Queue&#x7684;&#x521B;&#x5EFA;&#x4F53;&#x73B0;&#x6784;&#x9020;&#x8005;&#x89D2;&#x8272;&#xFF1B;&#x7A0E;&#x52A1;&#x62A5;&#x544A;&#x7684;&#x751F;&#x6210;&#x4F53;&#x73B0;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8005;&#x89D2;&#x8272;&#xFF1B;&#x670D;&#x52A1;&#x5B9A;&#x4F4D;&#x5668;&#x4F53;&#x73B0;&#x534F;&#x8C03;&#x8005;&#x89D2;&#x8272;&#xFF1B;&#x5185;&#x5BB9;&#x9A8C;&#x8BC1;&#x5668;&#x4F53;&#x73B0;&#x63A7;&#x5236;&#x8005;&#x89D2;&#x8272;&#xFF1B;</li>
</ol>
</blockquote>
<h4 id="4-&#x804C;&#x8D23;&#x4E0E;&#x5C01;&#x88C5;&#x7684;&#x5173;&#x7CFB;">4. &#x804C;&#x8D23;&#x4E0E;&#x5C01;&#x88C5;&#x7684;&#x5173;&#x7CFB;</h4>
<p>&#x7F3A;&#x4E4F;&#x5408;&#x7406;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x5C31;&#x4F1A;&#x7F3A;&#x5C11;&#x6B63;&#x786E;&#x7684;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x9886;&#x57DF;&#x4FE1;&#x606F;&#x6563;&#x4E71;&#x5206;&#x5E03;&#x5230;&#x7CFB;&#x7EDF;&#x5404;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;&#x6982;&#x5FF5;&#x4E0D;&#x591F;&#x6E05;&#x6670;&#xFF0C;&#x5BFC;&#x81F4;&#x804C;&#x8D23;&#x6DF7;&#x4E71;&#x3002;</p>
<h4 id="5-&#x6A21;&#x5757;&#x7EA7;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;">5. &#x6A21;&#x5757;&#x7EA7;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;</h4>
<blockquote>
<ol>
<li>&#x95EE;&#x9898;&#x5206;&#x6790;&#xFF1A;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x804C;&#x8D23;&#x7684;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x9762;&#x4E34;&#x4E09;&#x79CD;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#xFF1F;&#x901A;&#x8FC7;&#x5BF9;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x8BA8;&#x8BBA;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x677E;&#x8026;&#x5408;&#x7684;&#x7406;&#x89E3;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8BE5;&#x95EE;&#x9898;&#x5206;&#x6790;&#x8FD8;&#x5C06;&#x5F15;&#x5165;Template Method&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x95EE;&#x9898;&#x5206;&#x6790;&#xFF1A;&#x9519;&#x8BEF;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;&#x5E26;&#x6765;&#x7684;&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5305;&#x7684;&#x590D;&#x7528;&#x539F;&#x5219;&#x7684;&#x8FDD;&#x80CC;&#xFF0C;&#x63D0;&#x51FA;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1B;</li>
<li>&#x6A21;&#x5757;&#x91CD;&#x7528;&#xFF1A;&#x5BF9;eBay&#x6A21;&#x5757;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x67D0;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#xFF0C;&#x63D0;&#x51FA;&#x6A21;&#x5757;&#x91CD;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#xFF1B;</li>
</ol>
</blockquote>
<h4 id="6-&#x539F;&#x5219;&#x4E0E;&#x6A21;&#x5F0F;">6. &#x539F;&#x5219;&#x4E0E;&#x6A21;&#x5F0F;</h4>
<blockquote>
<ol>
<li>&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF1A;&#x5206;&#x6790;&#x8BE5;&#x539F;&#x5219;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF0C;&#x5173;&#x6CE8;&#x5BF9;&#x8C61;&#x7684;&#x53D8;&#x5316;&#x70B9;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x529F;&#x80FD;&#x5F15;&#x64CE;&#x4E2D;&#x5BF9;&#x529F;&#x80FD;&#x5BF9;&#x8C61;&#x7684;&#x52A0;&#x8F7D;&#xFF0C;&#x5982;&#x4F55;&#x4F53;&#x73B0;&#x804C;&#x8D23;&#x5206;&#x79BB;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#xFF1B;&#x901A;&#x8FC7;&#x5BF9;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x5F15;&#x5165;Proxy&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x4E13;&#x5BB6;&#x6A21;&#x5F0F;&#xFF1A;&#x4E13;&#x5BB6;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x6301;&#x6709;&#x8005;&#x662F;&#x64CD;&#x4F5C;&#x8BE5;&#x4FE1;&#x606F;&#x7684;&#x4E13;&#x5BB6;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x62A5;&#x8868;&#x53C2;&#x6570;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x8BBE;&#x8BA1;&#x8FDD;&#x80CC;&#x4E86;&#x4E13;&#x5BB6;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4F9D;&#x636E;&#x4E13;&#x5BB6;&#x6A21;&#x5F0F;&#x5BF9;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#xFF0C;&#x4ECE;&#x800C;&#x5DE7;&#x5999;&#x5730;&#x5229;&#x7528;&#x591A;&#x6001;&#x6D88;&#x9664;&#x4EE3;&#x7801;&#x574F;&#x5473;&#x9053;&#xFF0C;&#x5E76;&#x8FDB;&#x800C;&#x901A;&#x8FC7;&#x5F15;&#x5165;Adapter&#x6A21;&#x5F0F;&#x5904;&#x7406;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF1B;</li>
<li>&#x81EA;&#x6CBB;&#x5BF9;&#x8C61;&#xFF1A;&#x5206;&#x6790;&#x4E86;&#x81EA;&#x6CBB;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5206;&#x522B;&#x5305;&#x62EC;&#xFF1A;&#x6700;&#x5C0F;&#x5B8C;&#x5907;&#xFF0C;&#x7A33;&#x5B9A;&#x7A7A;&#x95F4;&#xFF0C;&#x81EA;&#x6211;&#x5C65;&#x884C;&#x4E0E;&#x72EC;&#x7ACB;&#x8FDB;&#x5316;&#x3002;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x7528;&#x6237;&#x72B6;&#x6001;&#x673A;&#xFF0C;&#x7ED9;&#x51FA;&#x4E86;&#x67D0;&#x91D1;&#x878D;&#x7CFB;&#x7EDF;&#x4E2D;&#x590D;&#x6742;&#x7684;&#x7528;&#x6237;&#x72B6;&#x6001;&#x8FC1;&#x79FB;&#xFF0C;&#x4F53;&#x73B0;&#x7684;&#x590D;&#x6742;&#x6388;&#x6743;&#x3001;&#x767B;&#x5F55;&#x7B49;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5E76;&#x7531;&#x6B64;&#x5F15;&#x5165;State&#x6A21;&#x5F0F;&#x6765;&#x7B80;&#x5316;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F53;&#x73B0;&#x81EA;&#x6CBB;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5F81;&#x3002;</li>
</ol>
</blockquote>
<h3 id="&#x7B2C;&#x4E8C;&#x5355;&#x5143;-&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x62BD;&#x8C61;">&#x7B2C;&#x4E8C;&#x5355;&#x5143; &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E4B;&#x62BD;&#x8C61;</h3>
<blockquote>
<ul>
<li>&#x62BD;&#x8C61;&#x4E0E;&#x53D8;&#x5316;</li>
<li>&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;</li>
</ul>
</blockquote>
<p>&#x5408;&#x7406;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x5353;&#x8D8A;&#xFF0C;&#x56E0;&#x4E3A;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5E38;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x8BBE;&#x8BA1;&#x5FC5;&#x987B;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x6EE1;&#x8DB3;&#x53D8;&#x5316;&#xFF0C;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<h4 id="1-&#x62BD;&#x8C61;&#x7684;&#x610F;&#x4E49;">1. &#x62BD;&#x8C61;&#x7684;&#x610F;&#x4E49;</h4>
<p>&#x62BD;&#x8C61;&#x7684;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x5BFB;&#x627E;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x6216;&#x884C;&#x4E3A;&#xFF09;&#x5177;&#x6709;&#x7684;&#x5171;&#x540C;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x5BF9;&#x7279;&#x6027;&#x8FDB;&#x884C;&#x6CDB;&#x5316;&#x3002;&#x6CDB;&#x5316;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x4EE5;&#x66B4;&#x9732;&#x5728;&#x5916;&#xFF0C;&#x4ECE;&#x800C;&#x9694;&#x79BB;&#x5185;&#x90E8;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<blockquote>
<ol>
<li>&#x7528;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x5BF9;&#x7528;&#x4F8B;&#x548C;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x6CDB;&#x5316;&#xFF1B;&#x9075;&#x5FAA;&#x7684;&#x539F;&#x5219;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x6388;&#x6743;&#x6846;&#x67B6;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F53;&#x73B0;&#x4E86;&#x5BF9;&#x5171;&#x540C;&#x7279;&#x5F81;&#x7684;&#x63D0;&#x53D6;&#xFF0C;&#x5408;&#x7406;&#x5F15;&#x5165;Chain Of Responsibility&#x6A21;&#x5F0F;&#x4E0E;Template Method&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x6A21;&#x578B;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x591A;&#x79CD;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5BF9;&#x5404;&#x79CD;&#x6A21;&#x578B;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5E76;&#x62BD;&#x8C61;&#x51FA;&#x6A21;&#x578B;&#x7684;&#x5171;&#x540C;&#x7279;&#x5F81;&#xFF0C;&#x4ECE;&#x800C;&#x7B80;&#x5316;&#x6A21;&#x578B;&#xFF1B;</li>
</ol>
</blockquote>
<h4 id="2-&#x8BC6;&#x522B;&#x53D8;&#x5316;">2. &#x8BC6;&#x522B;&#x53D8;&#x5316;</h4>
<p>&#x8981;&#x4FDD;&#x8BC1;&#x8BBE;&#x8BA1;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4E3B;&#x8981;&#x8FC7;&#x7A0B;&#x662F;&#x8BC6;&#x522B;&#x53D8;&#x5316;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x53D8;&#x5316;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#x3002;</p>
<blockquote>
<ol>
<li>&#x53D8;&#x5316;&#x70B9;&#xFF1A;&#x5E38;&#x89C1;&#x7684;&#x53D8;&#x5316;&#x70B9;&#x5305;&#x62EC;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x3001;&#x7B97;&#x6CD5;&#x7B56;&#x7565;&#x3001;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x3001;&#x786C;&#x4EF6;&#x652F;&#x6301;&#x3001;&#x547D;&#x4EE4;&#x8BF7;&#x6C42;&#x3001;&#x534F;&#x8BAE;&#x6807;&#x51C6;&#x3001;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3001;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x3001;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x3001;&#x754C;&#x9762;&#x8868;&#x73B0;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;Invoice&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#xFF0C;&#x5F15;&#x5165;Specification&#x6A21;&#x5F0F;&#xFF1B;CIMS&#x7CFB;&#x7EDF;&#x7684;&#x673A;&#x5668;&#x52A0;&#x8F7D;&#x7B56;&#x7565;&#xFF0C;&#x5F15;&#x5165;Strategy&#x6A21;&#x5F0F;&#xFF1B;&#x77ED;&#x4FE1;&#x670D;&#x52A1;&#xFF0C;&#x5F15;&#x5165;Facade&#x6A21;&#x5F0F;&#x4E0E;Adapter&#x6A21;&#x5F0F;&#xFF1B;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x7CFB;&#x7EDF;&#x8003;&#x52E4;&#x6A21;&#x5757;&#xFF0C;&#x5F15;&#x5165;Gateway&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;CQRS&#x6846;&#x67B6;&#xFF0C;&#x5BF9;&#x547D;&#x4EE4;&#x5904;&#x7406;&#x903B;&#x8F91;&#x7684;&#x5305;&#x88C5;&#xFF0C;&#x5F15;&#x5165;Decorator&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x53D8;&#x5316;&#x70B9;&#xFF0C;&#x5F15;&#x5165;&#x53E6;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;Decorator&#x6A21;&#x5F0F;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</li>
</ol>
</blockquote>
<h4 id="3-&#x4F9D;&#x8D56;&#x89E3;&#x8026;">3. &#x4F9D;&#x8D56;&#x89E3;&#x8026;</h4>
<p>&#x5904;&#x7406;&#x53D8;&#x5316;&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x89E3;&#x9664;&#x5BF9;&#x5177;&#x4F53;&#x5BF9;&#x8C61;&#x7684;&#x4F9D;&#x8D56;&#x3002;</p>
<blockquote>
<ol>
<li>&#x8868;&#x9A71;&#x52A8;&#x6CD5;</li>
<li>&#x914D;&#x7F6E;&#x4E0E;&#x53CD;&#x5C04;</li>
<li>IoC&#x5BB9;&#x5668;</li>
<li>&#x60EF;&#x4F8B;&#x4F18;&#x4E8E;&#x914D;&#x7F6E;</li>
</ol>
</blockquote>
<h4 id="4-&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;">4. &#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;</h4>
<p>&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5206;&#x522B;&#x4E3A;&#xFF1A;&#x5206;&#x79BB;&#x804C;&#x8D23;&#x5404;&#x53F8;&#x5176;&#x804C;&#xFF0C;&#x5229;&#x7528;&#x62BD;&#x8C61;&#x7EDF;&#x4E00;&#x63A5;&#x53E3;&#xFF0C;&#x5F15;&#x7528;&#x63A5;&#x53E3;&#x9884;&#x7559;&#x7A7A;&#x767D;&#x3002;&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x4FDD;&#x8BC1;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<blockquote>
<ol>
<li>&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x6B65;&#x9AA4;</li>
<li>&#x5B9E;&#x6218;&#x6F14;&#x7EC3;&#xFF1A;&#x8BA2;&#x5355;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x8FC7;&#x4E09;&#x6B21;&#x8FED;&#x4EE3;&#x9010;&#x6B65;&#x6539;&#x8FDB;&#x539F;&#x6709;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x5206;&#x522B;&#x9075;&#x5FAA;&#x4E13;&#x5BB6;&#x6A21;&#x5F0F;&#x3001;&#x5206;&#x79BB;&#x539F;&#x5219;&#x4E0E;&#x6269;&#x5C55;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF0C;&#x4FDD;&#x8BC1;&#x8BBE;&#x8BA1;&#x5728;&#x4FEE;&#x6539;&#x6700;&#x5C0F;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x6F14;&#x8FDB;&#x4E2D;&#xFF0C;&#x8BA8;&#x8BBA;&#x5BF9;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5408;&#x7406;&#x8FD0;&#x7528;&#xFF0C;&#x5E76;&#x5F15;&#x5165;Specification&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BE5;&#x6846;&#x67B6;&#x80FD;&#x591F;&#x652F;&#x6301;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x7684;&#x591A;&#x79CD;&#x5B58;&#x50A8;&#x5F62;&#x6001;&#xFF0C;&#x5305;&#x62EC;&#x6587;&#x4EF6;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;LDAP&#x7B49;&#xFF1B;&#x652F;&#x6301;&#x591A;&#x79CD;&#x83B7;&#x53D6;&#x914D;&#x7F6E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;Web&#x670D;&#x52A1;&#xFF0C;REST&#x670D;&#x52A1;&#x3002;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x7684;&#x63A5;&#x53E3;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x5176;&#x7EDF;&#x4E00;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x6EE1;&#x8DB3;&#x53EF;&#x6269;&#x5C55;&#x8981;&#x6C42;&#x4E0B;&#xFF0C;&#x63D0;&#x4F9B;&#x63A5;&#x53E3;&#x7684;&#x6613;&#x7528;&#x6027;&#x3002;</li>
<li>&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;&#x6D88;&#x606F;&#x961F;&#x5217;&#x89C4;&#x8303;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x901A;&#x8FC7;&#x5206;&#x6790;JMS&#x3001;MSMQ&#x3001;RabbitMQ&#x548C;NServiceBus&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x7406;&#x89E3;&#x62BD;&#x8C61;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x4F8B;&#x5982;&#x7406;&#x89E3;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x3001;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x3001;&#x6309;&#x610F;&#x56FE;&#x8BBE;&#x8BA1;&#x3001;Facade&#x6A21;&#x5F0F;&#x4E0E;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x6A21;&#x5F0F;&#x3002;
5.&#x5B9E;&#x6218;&#x6F14;&#x7EC3;&#xFF1A;CIMS&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x670D;&#x52A1;&#x7684;&#x7EDF;&#x4E00;&#x62BD;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x6D88;&#x606F;&#x5904;&#x7406;&#x7684;&#x804C;&#x8D23;&#x5206;&#x914D;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x534F;&#x4F5C;&#x5408;&#x7406;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x3002;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5F15;&#x5165;Command&#x6A21;&#x5F0F;&#x3001;Publisher &#x2013; Subscriber&#x6A21;&#x5F0F;&#x3001;Message Bus&#x6A21;&#x5F0F;&#x3001;Message Translator&#x6A21;&#x5F0F;&#x3001;Lookup&#x6A21;&#x5F0F;&#x3002;</li>
</ol>
</blockquote>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="http://crazywen.github.io/2016/05/19/卓越软件设计匠艺 —— 培训总结/" data-id="ciov6ojjx0006n0proejugykd" class="article-share-link">分享到</a><div class="tags"><a href="/tags/软件设计/">软件设计</a><a href="/tags/设计模式/">设计模式</a><a href="/tags/职责/">职责</a><a href="/tags/面向对象/">面向对象</a></div><div class="post-nav"><a href="/2016/05/30/Shell 脚本编程 —— 秘笈1/" class="pre">Shell 脚本编程 —— 秘笈1</a><a href="/2016/02/19/进程和线程/" class="next">进程和线程</a></div><div data-thread-key="2016/05/19/卓越软件设计匠艺 —— 培训总结/" data-title="卓越软件设计匠艺 —— 培训总结" data-url="http://crazywen.github.io/2016/05/19/卓越软件设计匠艺 —— 培训总结/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/05/19/卓越软件设计匠艺 —— 培训总结/" data-title="卓越软件设计匠艺 —— 培训总结" data-url="http://crazywen.github.io/2016/05/19/卓越软件设计匠艺 —— 培训总结/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search"/><input type="hidden" name="si" value="http://crazywen.github.io"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/技术/">技术</a><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/技术/工作/">工作</a></li></ul></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/职责/" style="font-size: 15px;">职责</a> <a href="/tags/http2-0/" style="font-size: 15px;">http2.0</a> <a href="/tags/Shell/" style="font-size: 15px;">Shell</a> <a href="/tags/Linux/" style="font-size: 15px;">Linux</a> <a href="/tags/软件设计/" style="font-size: 15px;">软件设计</a> <a href="/tags/设计模式/" style="font-size: 15px;">设计模式</a> <a href="/tags/Multiplexing/" style="font-size: 15px;">Multiplexing</a> <a href="/tags/面向对象/" style="font-size: 15px;">面向对象</a> <a href="/tags/并行/" style="font-size: 15px;">并行</a> <a href="/tags/并发/" style="font-size: 15px;">并发</a> <a href="/tags/进程/" style="font-size: 15px;">进程</a> <a href="/tags/线程/" style="font-size: 15px;">线程</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/05/31/Shell 脚本编程 —— 秘笈2/">Shell 脚本编程 —— 秘笈2</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/30/Shell 脚本编程 —— 秘笈1/">Shell 脚本编程 —— 秘笈1</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/05/19/卓越软件设计匠艺 —— 培训总结/">卓越软件设计匠艺 —— 培训总结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/19/进程和线程/">进程和线程</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/19/http2.0/">HTTP2.0 的改进</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/18/并行与并发/">并行和并发的区别</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="https://github.com/crazywen/" title="github-me" target="_blank">github-me</a><ul></ul><a href="https://qdan.me/" title="轻单" target="_blank">轻单</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">深度空间.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'crazywen'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>